app/controllers/post_details_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "post_details".* FROM "post_details" WHERE "post_details"."post_id" = $1 ORDER BY "post_details"."arrival_at" ASC  [["post_id", 20]]
---
  def new
    @post = Post.find(params[:post_id])
    @post_details = @post.post_details.order(arrival_at: :asc)

INSERT INTO "post_details" ("post_id", "body", "arrival_at", "image", "created_at", "updated_at", "address", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "post_details".* FROM "post_details" WHERE "post_details"."post_id" = $1 ORDER BY "post_details"."arrival_at" ASC  [["post_id", 20]]
---
  def create
    @post_detail = PostDetail.new(post_detail_params)
    @post = @post_detail.post

    if @post_detail.save
      @post_details = @post_detail.post.post_details.order(arrival_at: :asc)

SELECT "post_details".* FROM "post_details" WHERE "post_details"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def show
    @post_detail = PostDetail.find(params[:id])

SELECT "post_details".* FROM "post_details" WHERE "post_details"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
DELETE FROM "post_details" WHERE "post_details"."id" = $1  [["id", 62]]
SELECT "post_details".* FROM "post_details" WHERE "post_details"."post_id" = $1 ORDER BY "post_details"."arrival_at" ASC  [["post_id", 23]]
---
  def destroy
    @post_detail = PostDetail.find(params[:id])
    @post_detail.destroy!

    @post_details = @post_detail.post.post_details.order(arrival_at: :asc)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = $1, "status" = $2 WHERE "posts"."id" = $3  [["updated_at", "2024-11-02 16:39:25.309482"], ["status", 1], ["id", 24]]
---
  def publish
    @post = Post.find(params[:post_id])
    @post.status = 1

    if @post.save