app/controllers/posts_controller.rb

SELECT "post_details".* FROM "post_details" WHERE "post_details"."post_id" IN ($1, $2)  [["post_id", 25], ["post_id", 24]]
SELECT "posts".* FROM "posts" WHERE "posts"."status" = $1 ORDER BY "posts"."created_at" DESC  [["status", 1]]
---
  def index
    @q = Post.ransack(params[:q])
    @posts = @q.result(distinct: true).includes(:post_details).where(status: 1).order(created_at: :desc)

INSERT INTO "posts" ("title", "departure_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title_a"], ["departure_date", "2024-10-04"], ["created_at", "2024-10-26 14:29:47.273639"], ["updated_at", "2024-10-26 14:29:47.273639"], ["user_id", 2]]
---
  def create
    @post = current_user.posts.build(post_params)

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "post_details".* FROM "post_details" WHERE "post_details"."post_id" = $1 ORDER BY "post_details"."arrival_at" ASC  [["post_id", 7]]
---
  def show
    @post = Post.find(params[:id])
    @post_details = @post.post_details.order(:arrival_at)